[
  {
    "title": "Screening Soon: 'The Pathfinders' Trains Lens on Mars",
    "preview": "With the Mars 2020 mission ramping up, the documentary — the first of four about past JPL missions to the Red Planet to be shown at Caltech — tells a gripping backstory."
  },
  {
    "title": "6 Things to Know About NASA's Ingenuity Mars Helicopter",
    "preview": "The first helicopter attempting to fly on another planet is a marvel of engineering. Get up to speed with these key facts about its plans."
  },
  {
    "title": "NASA's MAVEN Observes Martian Night Sky Pulsing in Ultraviolet Light",
    "preview": "Vast areas of the Martian night sky pulse in ultraviolet light, according to images from NASA’s MAVEN spacecraft. The results are being used to illuminate complex circulation patterns in the Martian atmosphere."
  },
  {
    "title": "NASA, ULA Launch Mars 2020 Perseverance Rover Mission to Red Planet",
    "preview": "The agency's Mars 2020 mission is on its way. It will land at Jezero Crater in about seven months, on Feb. 18, 2021. "
  },
  {
    "title": "NASA Engineers Checking InSight's Weather Sensors",
    "preview": "An electronics issue is suspected to be preventing the sensors from sharing their data about Mars weather with the spacecraft."
  },
  {
    "title": "Media Get a Close-Up of NASA's Mars 2020 Rover",
    "preview": "The clean room at NASA's Jet Propulsion Laboratory was open to the media to see NASA's next Mars explorer before it leaves for Florida in preparation for a summertime launch."
  },
  {
    "title": "Curiosity Mars Rover's Summer Road Trip Has Begun",
    "preview": "After more than a year in the \"clay-bearing unit,\" Curiosity is making a mile-long journey around some deep sand so that it can explore higher up Mount Sharp."
  },
  {
    "title": "A Year of Surprising Science From NASA's InSight Mars Mission",
    "preview": "A batch of new papers summarizes the lander's findings above and below the surface of the Red Planet."
  },
  {
    "title": "Mars InSight Lander to Push on Top of the 'Mole'",
    "preview": "Engineers have a plan for pushing down on the heat probe, which has been stuck at the Martian surface for a year."
  },
  {
    "title": "InSight's 'Mole' Team Peers into the Pit",
    "preview": "Efforts to save the heat probe continue."
  },
  {
    "title": "The Detective Aboard NASA's Perseverance Rover",
    "preview": "An instrument called SHERLOC will, with the help of its partner WATSON, hunt for signs of ancient life by detecting organic molecules and minerals."
  },
  {
    "title": "NASA's Perseverance Mars Rover Gets Balanced",
    "preview": "The mission team performed a crucial weight-balancing test on the rover in preparation for this summer's history-making launch to the Red Planet."
  },
  {
    "title": "NASA's Perseverance Rover Is Midway to Mars ",
    "preview": "Sometimes half measures can be a good thing – especially on a journey this long. The agency's latest rover only has about 146 million miles left to reach its destination."
  },
  {
    "title": "All About the Laser (and Microphone) Atop Mars 2020, NASA's Next Rover",
    "preview": "SuperCam is a rock-vaporizing instrument that will help scientists hunt for Mars fossils."
  },
  {
    "title": "NASA Updates Mars 2020 Mission Environmental Review",
    "preview": "NASA and the Department of Energy have completed a more detailed risk analysis for the Mars 2020 rover launch from Florida."
  }
]